/*百元百鸡问题。我国古代数学家张丘键在《算经》中出了一道题：鸡翁一，值钱五；鸡母一，值钱三；鸡雏三，值钱一。百钱买百鸡，问鸡翁、鸡母、鸡雏各几何？这是一个古典数学问题，意思是说用一百个铜钱买了一百只鸡，其中公鸡一只5钱、母鸡一只3钱，小鸡一钱3只，问一百只鸡中公鸡、母鸡、小鸡各多少只。*/
#include <stdio.h>
void main()
{
    int i,j,k;//分别代表公鸡，母鸡和小鸡
    for(i=0;i<=20;i++)
      {
          for(j=0;j<=33;j++)
            {
               for(k=0;k<=100;k++)
                  {
                      if((i+j+k==100)&&(5*i+3*j+k/3==100))
                          {
                                printf("公鸡:%d  母鸡:%d  小鸡:%d\n",i,j,k);
                          }
                  }
            }
      }
    
}